{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\\\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "output_shape": null, "batch_input_shape": [null, 40, 80, 3], "input_dtype": "float32", "trainable": true, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"activation": "relu", "b_constraint": null, "nb_filter": 24, "subsample": [1, 1], "trainable": true, "name": "convolution2d_1", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_constraint": null, "nb_filter": 36, "subsample": [1, 1], "trainable": true, "name": "convolution2d_2", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_constraint": null, "nb_filter": 48, "subsample": [2, 2], "trainable": true, "name": "convolution2d_3", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_constraint": null, "nb_filter": 64, "subsample": [1, 1], "trainable": true, "name": "convolution2d_4", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_constraint": null, "nb_filter": 64, "subsample": [1, 1], "trainable": true, "name": "convolution2d_5", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "output_dim": 100, "bias": true, "name": "dense_1", "W_constraint": null, "input_dim": 19200, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "output_dim": 50, "bias": true, "name": "dense_2", "W_constraint": null, "input_dim": 100, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "output_dim": 10, "bias": true, "name": "dense_3", "W_constraint": null, "input_dim": 50, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}, {"config": {"b_constraint": null, "output_dim": 1, "bias": true, "name": "dense_4", "W_constraint": null, "input_dim": 10, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}